УТ_для_edt.РасширениеСмарт/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбеспечиватьЗаказыОбособленно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КалендарьВозвратаТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВозвращатьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдержатьВознаграждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентРучнойНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВозможнаРеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МинимальнаяСуммаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЧастотаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособРасчетаВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентРучнойСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОграничиватьРучныеСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Регулярное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Период</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодНаименованияСделки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособОпределенияЦеныСделки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРаботеТорговыхПредставителей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоступноВнешнимПользователям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СценарийПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РазбиватьРасходныеОрдераПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ПроцентРучнойНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="441849e1-2a80-4d78-b953-7de4fe6a6810">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="55815d36-173f-47ae-b3bd-d5e3a58b164f">
      <name>ВариантОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac11719-c923-4a29-ab63-a3f0bf59916c">
      <name>Сдвиг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4df435d0-1afa-43c8-8525-5d6cc15dcab6">
      <name>ПроцентПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="76d5d4e8-4a35-42e8-a685-57b38c0d7552">
      <name>ПроцентЗалогаЗаТару</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/СоглашенияСКлиентами/Forms/ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Смарт Фролов+ Задача № 85
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		смартУстановитьВидыЦенПоБазовомуВиду();
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

&НаСервере
&После("ПриИзмененииСоглашенияСервер")
Процедура смарт_ПриИзмененииСоглашенияСервер(ЗаполнитьУсловияПродаж)
	//смартКаратеев ++
	Объект.РазбиватьРасходныеОрдераПоРаспоряжениям = Объект.Соглашение.РазбиватьРасходныеОрдераПоРаспоряжениям;
	РазбиватьРасходныеОрдераПоРаспоряжениямЧисло = Число(Объект.Соглашение.РазбиватьРасходныеОрдераПоРаспоряжениям);
	//Каратеев --
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	МаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	Если ТекущийОбъект.ОграничиватьРучныеСкидки И ТекущийОбъект.ПроцентРучнойСкидки > МаксимальныйПроцентРучнойСкидки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процент ручной скидки не может быть выше макимального (" + МаксимальныйПроцентРучнойСкидки + ")!", , "ПроцентРучнойСкидки", "Объект.ПроцентРучнойСкидки", Отказ);
	КонецЕсли;	
	//--#1323 смарт: Лопато 15.03.2023

КонецПроцедуры

&НаСервере
Процедура смарт_ПроцентРучнойСкидкиПриИзмененииПослеНаСервере()

	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	смартПроверитьПроцентРучнойСкидки();
	//--#1323 смарт: Лопато 15.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПроцентРучнойСкидкиРегулированиеПосле(Элемент, Направление, СтандартнаяОбработка)
	
	//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
	смартПроверитьПроцентРучнойСкидки();
	//--#1323 смарт: Лопато 15.03.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Смарт Фролов+ Задача № 84
// Событие формы "Перед записью"
&НаКлиенте
Процедура смарт_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если Не смартДопПараметры=Неопределено Тогда // Ошибки уже были, больше о них не сообщаем.
		Возврат;
	КонецЕсли;	
	МассивСтрок=Объект.Товары.НайтиСтроки(Новый Структура("ВидЦены",ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")));
	Если МассивСтрок.Количество() И Не смартРазрешениеПоРолям() Тогда
		// Переходим к первому полю с ошибкой
		Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.СтраницаУточнениеПоТоварам;
		Элементы.Товары.ТекущаяСтрока=МассивСтрок[0].ПолучитьИдентификатор();
		Элементы.Товары.ТекущийЭлемент=Элементы.ТоварыВидЦены;
		
		смартДопПараметры=Новый Структура("ЗакрыватьФорму",Ложь);
		
		Оповещение=Новый ОписаниеОповещения("смартПослеЗакрытияФормыВопроса",ЭтаФорма);
		ТекстВопроса="Соглашение не будет действовать (есть 'произвольные' цены).
					|Для согласования 'произвольной цены' обратитесь к руководителю.";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОКОтмена,30,,"Записать со статусом 'Не согласовано'?");
	КонецЕсли;
КонецПроцедуры

// Смарт Фролов+ Задача № 84
// Событие формы "Перед закрытием"
&НаКлиенте
Процедура смарт_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Перем Закрывать;
	Если ТипЗнч(смартДопПараметры)=Тип("Структура") И смартДопПараметры.Свойство("ЗакрыватьФорму",Закрывать) И Не Закрывать Тогда 
		Отказ=Не Закрывать;
		смартДопПараметры.ЗакрыватьФорму=Истина;
	КонецЕсли;
КонецПроцедуры

// Смарт Фролов+ Задача № 85
// Процедура событие элемента формы "ВидЦены" ПриИзменении
&НаКлиенте
Процедура смарт_ВидЦенПриИзмененииВместо(Элемент)
	смартУстановитьВидыЦенПоБазовомуВиду();
КонецПроцедуры

// Смарт Задача № 85
// Процедура устанавливает фильтр выбора "Вида цены" в табличной части "Товары"
&НаСервере
Процедура смартУстановитьВидыЦенПоБазовомуВиду()
	МассивПараметровВыбора=Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Объект.ВидЦен));
	Элементы.ТоварыВидЦены.ПараметрыВыбора=Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Элементы.ТоварыВидЦены.СвязиПараметровВыбора=Новый ФиксированныйМассив(Новый Массив);
	
	МассивВидовЦен=Справочники.ВидыЦен.ДоступныеВидыЦен(Новый Структура("БазовыйВидЦены,ЦенаВключаетНДС",Объект.ВидЦен,Объект.ЦенаВключаетНДС));
	
	Элементы.ТоварыВидЦены.СписокВыбора.ЗагрузитьЗначения(МассивВидовЦен);
	Элементы.ТоварыВидЦены.СписокВыбора.Добавить(Справочники.ВидыЦен.ПустаяСсылка(), НСтр("ru='<произвольная>'"));
КонецПроцедуры	
// Фролов-

// Смарт Фролов+ Задача № 84
// Процедура после закрытия формы Вопроса
&НаКлиенте
Процедура смартПослеЗакрытияФормыВопроса(Результат,ДопПараметры) Экспорт
	Если Результат=КодВозвратаДиалога.ОК Тогда
		Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано");
		Объект.Согласован=Ложь;
		ЭтаФорма.Записать();
		Закрывать=Неопределено;
		Если ТипЗнч(смартДопПараметры)=Тип("Структура") И смартДопПараметры.Свойство("ЗакрыватьФорму",Закрывать) И Закрывать Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		смартДопПараметры=Неопределено;
	КонецЕсли;
КонецПроцедуры

// Смарт Задача № 84
// Функция возвращает разрешено ли пользователю записывать Соглашение с произвольными ценами
&НаСервереБезКонтекста
Функция смартРазрешениеПоРолям()
	Возврат РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПравилВеденияСделок");
КонецФункции	
// Фролов-

//++#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок
&НаСервере
Процедура смартПроверитьПроцентРучнойСкидки()
	
	МаксимальныйПроцентРучнойСкидки = Константы.смартМаксимальныйПроцентРучнойСкидки.Получить();
	Если Объект.ОграничиватьРучныеСкидки И Объект.ПроцентРучнойСкидки > МаксимальныйПроцентРучнойСкидки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Процент ручной скидки не может быть выше макимального (" + МаксимальныйПроцентРучнойСкидки + ")!");
	КонецЕсли;	
	
КонецПроцедуры //--#1323 смарт: Лопато 15.03.2023

#КонецОбласти
